In [1]:
import pandas as pd

In [2]:
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv"
df = pd.read_csv(url)

In [3]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [6]:
df['total_bill'] # Single column (as Series)

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [7]:
type(df['total_bill'])

pandas.core.series.Series

In [8]:
df[['day', 'time']] # Multiple columns (as DataFrame)

      day    time
0     Sun  Dinner
1     Sun  Dinner
2     Sun  Dinner
3     Sun  Dinner
4     Sun  Dinner
..    ...     ...
239   Sat  Dinner
240   Sat  Dinner
241   Sat  Dinner
242   Sat  Dinner
243  Thur  Dinner

[244 rows x 2 columns]

In [12]:
df.loc[0]                # First row (by label)

total_bill     16.99
tip             1.01
sex           Female
smoker            No
day              Sun
time          Dinner
size               2
Name: 0, dtype: object

In [13]:
df.iloc[0]               # First row (by position)

total_bill     16.99
tip             1.01
sex           Female
smoker            No
day              Sun
time          Dinner
size               2
Name: 0, dtype: object

In [15]:
df.loc[0, "total_bill"]        # Value at row 0, column 'Name'

np.float64(16.99)

In [16]:
df.iloc[0, 1]            # Value at row 0, column at index 1

np.float64(1.01)

In [19]:
df.loc[0:5, ["day", "time"]]   # Rows 0 to 2, selected columns

   day    time
0  Sun  Dinner
1  Sun  Dinner
2  Sun  Dinner
3  Sun  Dinner
4  Sun  Dinner
5  Sun  Dinner

In [18]:
df.iloc[0:2, 0:2]              # Rows and cols by index position

   total_bill   tip
0       16.99  1.01
1       10.34  1.66

In [20]:
df.at[0, "time"]       # Fast label-based access

'Dinner'

In [21]:
df.iat[0, 1]           # Fast position-based access

np.float64(1.01)

In [26]:
df[df['size']>4]   #here it filters the data, with size greater than 4

     total_bill   tip     sex smoker   day    time  size
125       29.80  4.20  Female     No  Thur   Lunch     6
141       34.30  6.70    Male     No  Thur   Lunch     6
142       41.19  5.00    Male     No  Thur   Lunch     5
143       27.05  5.00  Female     No  Thur   Lunch     6
155       29.85  5.14  Female     No   Sun  Dinner     5
156       48.17  5.00    Male     No   Sun  Dinner     6
185       20.69  5.00    Male     No   Sun  Dinner     5
187       30.46  2.00    Male    Yes   Sun  Dinner     5
216       28.15  3.00    Male    Yes   Sat  Dinner     5

In [38]:
df.query("total_bill > 35 and size > 3")

     total_bill   tip     sex smoker   day    time  size
11        35.26  5.00  Female     No   Sun  Dinner     4
23        39.42  7.58    Male     No   Sat  Dinner     4
56        38.01  3.00    Male    Yes   Sat  Dinner     4
59        48.27  6.73    Male     No   Sat  Dinner     4
95        40.17  4.73    Male    Yes   Fri  Dinner     4
142       41.19  5.00    Male     No  Thur   Lunch     5
156       48.17  5.00    Male     No   Sun  Dinner     6
197       43.11  5.00  Female    Yes  Thur   Lunch     4
207       38.73  3.00    Male    Yes   Sat  Dinner     4
212       48.33  9.00    Male     No   Sat  Dinner     4

Querying with .query()
The .query() method in pandas lets you filter DataFrame rows using a string expression — it's a more readable and often more concise alternative to using boolean indexing.

This is a cleaner, SQL-like way to filter:

In [35]:
df[(df['size']>4) & (df['smoker'] == 'No')]

     total_bill   tip     sex smoker   day    time  size
125       29.80  4.20  Female     No  Thur   Lunch     6
141       34.30  6.70    Male     No  Thur   Lunch     6
142       41.19  5.00    Male     No  Thur   Lunch     5
143       27.05  5.00  Female     No  Thur   Lunch     6
155       29.85  5.14  Female     No   Sun  Dinner     5
156       48.17  5.00    Male     No   Sun  Dinner     6
185       20.69  5.00    Male     No   Sun  Dinner     5

Here are the main rules and tips for using .query() in pandas:

1. Column names become variables
You can reference column names directly in the query string:

In [40]:
df.query("tip > 4 and size > 4")

     total_bill   tip     sex smoker   day    time  size
125       29.80  4.20  Female     No  Thur   Lunch     6
141       34.30  6.70    Male     No  Thur   Lunch     6
142       41.19  5.00    Male     No  Thur   Lunch     5
143       27.05  5.00  Female     No  Thur   Lunch     6
155       29.85  5.14  Female     No   Sun  Dinner     5
156       48.17  5.00    Male     No   Sun  Dinner     6
185       20.69  5.00    Male     No   Sun  Dinner     5

In [ ]:
2. String values must be in quotes
Use single or double quotes around strings in the expression:

df.query("name == 'Harry'")

If you have quotes inside quotes, mix them:

df.query('city == "Mumbai"')

In [ ]:
3. Use backticks for column names with spaces or special characters
If a column name has spaces, use backticks (`):

df.query("`first name` == 'Alice'")

In [ ]:
4. You can use @ to reference Python variables
To pass external variables into .query():

age_limit = 30
df.query("age > @age_limit")

In [ ]:
5. Logical operators
Use these:

and, or, not — instead of &, |, ~
==, !=, <, >, <=, >=
Bad:

df.query("age > 30 & city == 'Delhi'")  # ❌

Good:

df.query("age > 30 and city == 'Delhi'")  # ✅

In [ ]:
6. Chained comparisons
Just like Python:

df.query("25 < age <= 40")

In [ ]:
7. Avoid using reserved keywords as column names
If you have a column named class, lambda, etc., you’ll need to use backticks:

df.query("`class` == 'Physics'")

In [ ]:
8. Case-sensitive
Column names and string values are case-sensitive:

df.query("City == 'delhi'")  # ❌ if actual value is 'Delhi'

In [ ]:
9. .query() returns a copy, not a view
The result is a new DataFrame. Changes won't affect the original unless reassigned:

filtered = df.query("age < 50")